#+TITLE: 工作流
#+AUTHOR: 胡琛
#+CAPTION:   笃行克己

* Work

** Tasks
*** DONE 中英文简历
    CLOSED: [2017-04-17 周一 09:52] SCHEDULED: <2017-04-17 周一 09:20>
    :PROPERTIES:
    :CREATED:  [2017-04-17 周一 09:13]
    :Effort:   30
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-17 周一 09:18]-[2017-04-17 周一 09:52] =>  0:34
    :END:
*** NEXT TB策略大体回测
    SCHEDULED: <2017-04-24 周一 19:00>
    :PROPERTIES:
    :CREATED:  [2017-04-24 周一 15:31]
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-24 周一 15:31]--[2017-04-24 周一 15:32] =>  0:01
    :END:
** Projects

*** TODO 程序化短课
    SCHEDULED: <2017-04-13 周四 19:00.+7d>

* Personal

** Tasks
*** DONE 整理期货程序化交易中需要注意的问题
    CLOSED: [2017-04-23 周日 14:54] SCHEDULED: <2017-04-17 周一 11:15>
    :PROPERTIES:
    :CREATED:  [2017-04-11 周二 11:12]
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-17 周一 14:30]--[2017-04-17 周一 14:42] =>  0:12
    CLOCK: [2017-04-11 周二 11:15]--[2017-04-11 周二 11:31] =>  0:16
    :END:
*** DONE 心理线指标改进
    CLOSED: [2017-04-17 周一 09:15]
    :PROPERTIES:
    :CREATED:  [2017-04-11 周二 13:40]
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-15 周六 21:34]--[2017-04-15 周六 22:00] =>  0:26
    CLOCK: [2017-04-13 周四 10:20]--[2017-04-13 周四 10:45] =>  0:25
    CLOCK: [2017-04-13 周四 09:38]--[2017-04-13 周四 10:03] =>  0:25
    CLOCK: [2017-04-12 周三 13:34]--[2017-04-12 周三 14:30] =>  0:56
    CLOCK: [2017-04-11 周二 23:21]--[2017-04-11 周二 23:46] =>  0:25
    CLOCK: [2017-04-11 周二 22:56]--[2017-04-11 周二 23:21] =>  0:25
    CLOCK: [2017-04-11 周二 15:26]--[2017-04-11 周二 15:48] =>  0:22
    CLOCK: [2017-04-11 周二 13:43]--[2017-04-11 周二 15:16] =>  1:33
    CLOCK: [2017-04-11 周二 13:40]--[2017-04-11 周二 13:41] =>  0:01
    :END:
*** NEXT 布林通道策略改进
    :PROPERTIES:
    :CREATED:  [2017-04-11 周二 15:49]
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-11 周二 15:49]--[2017-04-11 周二 15:58] =>  0:09
    :END:
*** DONE 下载 Youtube 上对应 Python 视频
    CLOSED: [2017-04-13 周四 14:54]
    :PROPERTIES:
    :CREATED:  [2017-04-12 周三 15:12]
    :END:
*** WAITING 周末陪潘丽君看房子                                      :WAITING:
    SCHEDULED: <2017-04-23 周日>
    :PROPERTIES:
    :CREATED:  [2017-04-19 周三 11:03]
    :END:
    
    Because of the rainy day, maybe some  day later.

** Projects

*** TODO Scikit-learn 学习计划 [0%]
    SCHEDULED: <2017-04-17 周一 13:00 .+1d>
    
    - [ ] Supervised Learning
      - [ ] Generalized Linear Models
      - [ ] Linear and Quadratic Discriminant Analysis
      - [ ] Kernel Ridge Regression
      - [ ] Support Vector Machines
      - [ ] Stochastic Gradient Descent
      - [ ] Nearest Neighbors
      - [ ] Gaussian Processes
      - [ ] Cross Decomposition
      - [ ] Naive Bayes
      - [ ] Decision Tress
      - [ ] Ensemble Methods
      - [ ] Multi-class And Multi-label Algorithm
      - [ ] Feature Selection
      - [ ] Semi-Supervised
      - [ ] Isotonic Regression
      - [ ] Probability Calibration
      - [ ] Neural Network Models (supervised)
    - [ ] Unsupervised Learning
      - [ ] Gaussian Mixture Models
      - [ ] Manifold Learning
      - [ ] Clustering
      - [ ] Bi-clustering
      - [ ] Decomposing Signals in Components (matrix factorization problems)
      - [ ] Covariance Estimation
      - [ ] Novelty and Outlier Detection
      - [ ] Density Estimation
      - [ ] Neural Network Models (unsupervised)
    - [ ] Model Selection And Evaluation
      - [ ] Cross-validation: Evaluating Estimator Performance
      - [ ] Tuning The Hyper-parameters of An Estimator
      - [ ] Model Evaluation: Quantifying the Quality of Predictions
      - [ ] Model Persistence
      - [ ] Validation Curves: Plotting Scores to Evaluate Models
    - [ ] Dataset Transformations
      - [ ] Pipeline and Feature Union: Combining Estimators
      - [ ] Feature Extraction
      - [ ] Preprocessing Data
      - [ ] Random Projection
      - [ ] Kernel Approximation
      - [ ] Pairwise Metrics, Affinities and Kernels
      - [ ] Transforming The Predictor Target (y)
    - [ ] Dataset Loading Utilities
      - [ ] General Dataset API
      - [ ] Toy Dataset
      - [ ] Sample Images
      - [ ] Sample Generators
      - [ ] Datasets in =svmlight= / =libsvm=  Format
      - [ ] Loading From External Datasets
      - [ ] The Olivetti Faces Dataset
      - [ ] The 20 Newsgroups Text Dataset
      - [ ] Downloading Datasets From the =mldata.org= repository
      - [ ] The Labeled Faces in The Wild Face Recognition Dataset
      - [ ] Forest Cover Types
      - [ ] =RCV1= Dataset
      - [ ] Boston House Prices Dataset
      - [ ] Breast Cancer Wisconsin (Dignostic) Dataset
      - [ ] Diabetes Dataset
      - [ ] Optical Recognition of Handwritten Digits Data Set
      - [ ] Iris Plants Database
      - [ ] Linnerrud Dataset
    - [ ] Strategies to scale computationally: bigger data
      - [ ] Scaling with Instances Using Out-of-core Learning
    - [ ] Computational Performance
      - [ ] Prediction Latency
      - [ ] Prediction Throughput
      - [ ] Tips And Tricks

*** WAITING vnpy 学习计划                                           :WAITING:
    SCHEDULED: <2017-04-17 周一 10:00>
    :LOGBOOK:
    CLOCK: [2017-04-17 周一 10:40]--[2017-04-17 周一 11:05] =>  0:25
    CLOCK: [2017-04-17 周一 10:03]--[2017-04-17 周一 10:28] =>  0:25
    CLOCK: [2017-04-13 周四 14:54]--[2017-04-13 周四 15:04] =>  0:10
    CLOCK: [2017-04-11 周二 16:36]--[2017-04-11 周二 17:01] =>  0:25
    :END:
    - [X] 安装与配置

*** NEXT RiceQuant 学习计划 [66%]
    SCHEDULED: <2017-04-21 周五 10:00>
    :LOGBOOK:
    CLOCK: [2017-04-20 周四 13:37]--[2017-04-20 周四 14:02] =>  0:25
    CLOCK: [2017-04-19 周三 19:46]--[2017-04-19 周三 20:11] =>  0:25
    CLOCK: [2017-04-18 周二 16:02]--[2017-04-18 周二 16:27] =>  0:25
    CLOCK: [2017-04-18 周二 15:19]--[2017-04-18 周二 15:44] =>  0:25
    :END:

    - [X] 配置与安装
    - [X] Quick Start
    - [-] 简单策略
      - [X] 买入并一直持有
      - [X] MACD 算法
      - [X] Golden Cross 算法
      - [X] 多股票 RSI 算法示例
      - [ ] 海龟交易系统
      - [ ] 股指期货 MACD 日回测
      - [ ] 商品期货跨品种配对交易

*** NEXT UQER 学习计划 [/]]
    :LOGBOOK:
    CLOCK: [2017-04-21 周五 10:25]--[2017-04-21 周五 10:50] =>  0:25
    :END:
        
    - [ ] Quick Start
    - [ ] 

*** NEXT 技术指标计划 [2/5]
    :LOGBOOK:
    CLOCK: [2017-04-20 周四 10:21]--[2017-04-20 周四 10:46] =>  0:25
    CLOCK: [2017-04-20 周四 09:36]--[2017-04-20 周四 10:01] =>  0:25
    :END:
    
    + [X] 威廉指标
    + [X] KDJ
    + [ ] PSY 指标
    + [ ] MACD
    + [ ] 平滑移动平均线
        
* Miscellaneous

** Habit

*** 吾日三省吾身 
    SCHEDULED: <2017-04-11 周二 22:30.+1d>

*** 健身
    SCHEDULED: <2017-04-11 周二 20:00.+1d>

*** 周三组会
    SCHEDULED: <2017-04-12 周三 10:00.+7d>

** Finance

*** 房租
  
**** 2017/01

     + 押金： -13200.00
     + 电费： -141.44
     + 首月租金： -6600.00
     + 水费： -33.00
     + 网费： -2379.00
     + 保安介绍费： -1200.00
     + 总额： -23553.44
     + 王雄已缴：20000.00
     + 胡琛已缴：2412.00
     + 李翔已缴：5734.44
     + 王雄结转：9748.85
       20000.00 - 9000.00 (首月租金加押金) - 47.15 (电费) - 11.00 (纯净水) - 793.00 (网费) - 400.00 (保安介绍费) = 9748.85
     + 李翔结转： -316.71 
       5734.44 - 4800 (首月押金加租金) - 47.15 (电费) - 11.00 (纯净水) - 793.00 (网费) - 400 (保安介绍费) = -316.71

**** 2017/02

     + 房租： -6600.00
     + 王雄房门开锁换锁： -160.00
     + 1 月网费： -200.00 (1 月网费是单独计费)
     + 王雄结转：9748.85 - 3000.00(房租) - 67.00(网费) - 160.00(房锁) = 6521.85
     + 李翔结转： -316.71 - 67.00(网费) = -383.71

**** 2017/03
       
     + 房租： -6600.00
     + 物业管理费：789.00
     + 电费：76.84
     + 王雄结转：6521.85 - 3000.00(房租) - 263.00(物业) - 25.61(电费) = 3233.24 
     + 李翔结转：0.00 - 25.61(电费) = -25.61

**** 2017/04
     
     + 房租： -6600.00
     + 王雄结转：3233.24 - 3000(房租) = 233.24
     + 李翔结转：0.00
       
*** 出书经费 

    + 总额：12000
    + 2016 年 12 月工资： -3000.00
    + 2017 年 1 月工资： -3000.00
    + 2017 年 2 月工资： -3000.00
    + 其他支出：
      - 牛奶： -100.00 (黄镇海)
      - 咖啡： -200.00 (甄赏)
      - 吃饭： -500.00 (胡琛)
      - 交通： -200.00 (胡琛)
    + 结余：2000.00

*** 日常支出

**** 2017/04/17

       | 支出类别 | 支出明细                 | 支出金额 |
       |----------+--------------------------+----------|
       | 早饭     | 榨菜、菠萝包、白粥       |     3.30 |
       | 午饭     | 荷叶糯米饭、红枣西米椰奶 |    15.00 |
       | 非必要   | 芝士奶盖绿               |    14.00 |
       | 晚饭     | 板烧厨房                 |    58.00 |
       | 水果     | 桂庙水果町               |    28.00 |
       | 其他     | 狼人杀卡牌               |     9.90 |
       |----------+--------------------------+----------|
       | 合计     |                          |   128.20 |

**** 2017/04/18

     | 支出类别 | 支出明细             | 支出金额 |
     |----------+----------------------+----------|
     | 早饭     | 南瓜饼、煎蛋、白粥   |     2.70 |
     | 非必要   | (星巴克) 拿铁        |    31.00 |
     | 晚饭     | 板烧厨房             |    18.00 |
     | 非必要   | (The One) 芝士奶盖绿 |    14.00 |
     |----------+----------------------+----------|
     | 合计     |                      |    65.70 |

**** 2017/04/19

     | 支出类别 | 支出明细                     | 支出金额 |
     |----------+------------------------------+----------|
     | 早饭     | (Starbucks) 拿铁、牛肉薯蓉派 |    60.00 |
     | 午饭     | (百姓渔村)请客               |   387.00 |
     | 非必要   | 芝士奶盖绿2杯                |    29.00 |
     | 晚饭     | 荷叶糯米饭、红枣西米椰汁     |    15.00 |
     | 其他     | 迅雷会员                     |   149.00 |
     |----------+------------------------------+----------|
     | 合计     |                              |          |

**** 2017/04/20

     | 支出类别 | 支出明细                         | 支出金额 |
     |----------+----------------------------------+----------|
     | 早饭     | 白粥、鸡蛋饼、煎蛋、榨菜         |     2.90 |
     | 午饭     | 菠萝、西兰花、杏鲍菇、鸡排、煎鱼 |     8.60 |
     | 下午茶   | 焦糖玛奇朵、牛角包               |    33.50 |
     | 夜宵     | 烤串、士多啤梨                   |   136.00 |
     |----------+----------------------------------+----------|
     | 合计     |                                  |   181.00 |

**** 2017/04/21

     | 支出项目 | 支出明细           | 支出金额 |
     |----------+--------------------+----------|
     | 早饭     | 白粥、蛋挞、鸡蛋饼 |     3.00 |
     | 午饭     | 木耳炒肉           |    18.00 |
     | 非必要   | 士多啤梨           |    36.00 |
     | 饮料     | 百鹤矿泉水、茶饮   |    17.00 |
     | 非必要   | (Starbucks) 拿铁   |    31.00 |
     |----------+--------------------+----------|
     | 合计     |                    |   105.00 |

**** 2017/04/22

     | 支出项目 | 支出明细              | 支出金额 |
     |----------+-----------------------+----------|
     | 午饭     | 木耳炒肉              |    18.00 |
     | 非必要   | (Starbucks) 拿铁      |    36.00 |
     | 晚饭     | (深港荣) 龙利鱼、葡挞 |    68.00 |
     | 非必要   | (The One) 芝士奶盖绿  |    18.00 |
     | 夜宵     | 牛肉粉丝汤            |    18.00 |
     |----------+-----------------------+----------|
     | 合计     |                       |   158.00 |
**** 2017/04/23

     | 支出项目 | 支出明细                   | 支出金额 |
     |----------+----------------------------+----------|
     | 午饭     | (DKC) 美式汉堡套餐、冻柠茶 |    68.00 |
     | 非必要   | (Starbucks) 拿铁           |    31.00 |
     | 晚饭     | (板烧厨房) 木耳炒肉        |    18.00 |
     | 非必要   | (The One) 芝士奶盖绿       |    14.00 |
     | 夜宵     | 牛肉粉丝汤                 |    18.00 |
     |----------+----------------------------+----------|
     | 合计     |                            | 149.00   |

**** 2017/04/24

     | 支出项目 | 支出明细                       | 支出金额 |
     |----------+--------------------------------+----------|
     | 早饭     | (Starbucks) 拿铁、火腿芝士可颂 |    51.00 |
     | 非必要   | 芝士奶盖乌龙、芒果绿           |    38.00 |
     | 晚饭     | (DKC) 美式汉堡、冻柠茶         |    68.00 |
     | 夜宵     | 牛肉粉丝汤                     |    18.00 |
     | 非必要   | (The One) 芝士奶盖绿           |    14.00 |

**** 2017/04/25

     | 支出项目 | 支出明细           | 支出金额 |
     |----------+--------------------+----------|
     | 早饭     | (Starbucks) 馥瑞白 |    34.00 |
     | 饮料     | 拿铁、海盐芝士绿   |    37.00 |
